#ให้ทำโปรแกรมป้อนจำนวนเงิน และจำนวนคนทางแป้นพิมพ์ และแสดงผลออกมาว่า
#จำนวนเงิน ???? บาท จำนวน ???? คน ต้องหารกันคนละ ???? บาท
#ให้แสดงผลโดยใช้ print ทั้ง 5 แบบ
money = input('ป้อนจำนวนเงิน : ')
person = input('ป้อนจำนวนคน : ')
final = float(money)/int(person)
print('------------------------------')
print(f'จำนวนเงิน {money} บาท จำนวนคน {person} คน ต้องหารกันคนละ {final:.2f} บาท')
print('จำนวนเงิน',round(float(money),2),'บาท จำนวนคน',person,'คน ต้องหารกันคนละ',f'{final:.2f}','บาท')
print('จำนวนเงิน' +money+ 'บาท'+'จำนวนคน'+person+'คน'+'.ต้องหารกันคนละ'f'{final:.2f}'+'บาท')
print('จำนวนเงิน {} บาท จำนวนคน {} ต้องหารกันคนละ {:.2f}บาท'.format(money,person,final))#.format
print('จำนวนเงิน %s บาท จำนวนคน %s คน ต้องหารกันคนละ %.2f บาท' %(money,person,final)) #%
